# Format Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FileExportedEventArgs..::..Format Property
FileExportedEventArgs Class See Also
---
Identifies the export format, e.g. DWG or image.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public ImportExportFileFormat Format { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Format As ImportExportFileFormat
	Get
```

Visual C++
---
```text
public:
property ImportExportFileFormat Format {
	ImportExportFileFormat get ();
}
```

# See Also
FileExportedEventArgs Class
Autodesk.Revit.DB.Events Namespace